app/controllers/common_cores_controller.rb

SELECT "common_cores".* FROM "common_cores"
---
  def index
    @common_cores = CommonCore.all